school/app/controllers/courses_controller.rb

	def create
		course = Course.new
		course.name = params[:name]
		course.location = params[:location]
		course.description = params[:description]
		course.save
---
INSERT INTO "courses" ("name", "location", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Course Name Algebra"], ["location", "Durham"], ["description", "Working with numbers"], ["created_at", "2019-01-26 22:53:00.673274"], ["updated_at", "2019-01-26 22:53:00.673274"]]

    def edit
	    @course = Course.find(params[:id])
        course = Course.find(params[:id])
		course.name = params[:name]
		course.location = params[:location]
		course.description = params[:description]
		course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "courses" SET "name" = ?, "location" = ?, "description" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", nil], ["location", nil], ["description", nil], ["updated_at", "2019-01-31 03:27:11.808151"], ["id", 5]]

    def update
        course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]